// C++ 자료구조 트리

// 자료구조: 데이터를 효율적으로 관리하는 방법
// -> 배열, 리스트, 트리, 그래프...

// 그래프:
// 데이터를 정점(노드)로 관리하며, 연결관계를 나타내는 자료구조

// 트리:
// 서킷(사이클)이 불가능한 그래프 자료구조
// 서킷이 가능한 예시로는 '한붓그리기'가 있음
// 트리는 일반적으로 계층관계를 표현할 때 주로 사용한다.

// 트리용어:
// 루트 - 가장 위에있는 노드, 부모가 없는 노드
// 리프(단말) - 자식이 없는 노드
// 부모, 자식, 형제
// 높이 - 트리의 가장 높은 레벨

// 이진트리:
// 부모노드가 자식노드를 최대 2개까지 가질 수 있는 트리

// 완전 이진트리:
// 트리를 구성할때, 왼쪽에서 오른쪽으로 채워가는 형태
// (=한 레벨을 순서대로 채우는 형태)로 데이터를 추가한다.
// 순서대로 채우는 형태이기 때문에 배열을 이용해 구현한다.

// 자료구조 힙(완전 이진트리를 이용해서 구현)


int main()
{

	return 0;
}